---
kind: enumMember
id: F:Autodesk.Revit.DB.Architecture.PatternJustification.Center
enum: Autodesk.Revit.DB.Architecture.PatternJustification
source: html/84331a13-d499-65fa-8d6c-75a83ee3cb42.htm
---
# Autodesk.Revit.DB.Architecture.PatternJustification.Center

Patterns are distributed starting from the center of a railing path.